#+TITLE: 研習彩蛋

* 作答記錄讀取
=this is a test=
/another test/
+how about this+
+中文可以嗎+
/中文/
*中文*

#+begin_src python -r -n :results output :exports both
import pandas as pd
#process history
history = pd.read_csv("~/Downloads/104.csv")
h1 = history.loc[history.uid >= 4336].sort_values(by='uid')
h2 = h1.loc[h1.uid <= 4372]
#print(h2)
# process name
name = pd.read_csv("~/Downloads/account.csv")
n1 = name[['uid','nickname']].sort_values(by = 'uid')
#print(n1)
#merge two df
mg_left=pd.merge(left=h2, right=n1, how='left', left_on='uid', right_on='uid')
#print(mg_left.sort_values(by='uid'))
# item
itemsAry = [["QA",288],["A",58],["A",59],["A",153],["B",60],["B",63],["B",154],["B",155],["C",61],["C",62],["C",156],["C",247],["D",101],["D",102],["D",103],["D",274],["E",107],["E",108],["E",109],["B1",282],["B1",286],["B2",287],["B2",118],["B3",281],["B3",283],["B4",284],["B4",285]]
itemsdf = pd.DataFrame(itemsAry, columns = ["item", "pid"])
#print(itemsdf)
scores = pd.merge(left=mg_left, right=itemsdf, how = 'left', left_on = 'pid', right_on = 'pid')
done=scores[['nickname','item','score','timestamp']]

done['ni']=done['nickname'].astype(str) + done['item'].astype(str)
print(done)
done1 = done.drop_duplicates(subset='ni', keep='last')
done2 = done1[['nickname', 'item', 'score']]
done3 = done2.pivot(index='nickname', columns='item', values='score')
done4 = done3.fillna(0)
done4 = done4[[ 'A', 'B', 'C', 'D', 'E', 'B1', 'B2', 'B3', 'B4']]
print(done4.columns.values)
done4['ALL'] = done4.sum(axis=1)
print(done4)
done4.to_csv("~/Downloads/TNFSH_109上學期期中考_104.csv")

#+end_src

* 統計錄影時間
#+begin_src python -r -n :results output :exports both
from os import listdir
from os.path import join
from moviepy.editor import VideoFileClip

def caltime(path):
    files = listdir(path)

    tot = 0
    for f in files:
        if f.endswith("mp4"):
           fullpath = join(path, f)
           clip = VideoFileClip(fullpath)
           tot += clip.duration
           print(clip.duration/50,": ", fullpath)
    return tot/3600

path = "/Users/letranger/Desktop/研習/入門"
print("入門: %.2f小時" %(caltime(path)))
path = "/Users/letranger/Desktop/研習/進階"
print("入門: %.2f小時" %(caltime(path)))


#+end_src

#+RESULTS:
#+begin_example
42.9666 :  /Users/letranger/Desktop/研習/入門/3-Python變數與輸入輸出.mp4
22.4354 :  /Users/letranger/Desktop/研習/入門/9-彩蛋.mp4
9.608600000000001 :  /Users/letranger/Desktop/研習/入門/4-Python運算元.mp4
8.8154 :  /Users/letranger/Desktop/研習/入門/5-Python條件判斷.mp4
17.0126 :  /Users/letranger/Desktop/研習/入門/6-Python迴圈結構.mp4
40.816 :  /Users/letranger/Desktop/研習/入門/2-Python環境建置.mp4
20.722600000000003 :  /Users/letranger/Desktop/研習/入門/1-python簡介.mp4
29.318 :  /Users/letranger/Desktop/研習/入門/8-Python函數.mp4
44.06399999999999 :  /Users/letranger/Desktop/研習/入門/7-Python資料型別.mp4
入門: 3.27小時
75.9134 :  /Users/letranger/Desktop/研習/進階/3-Matplitlib.mp4
104.8274 :  /Users/letranger/Desktop/研習/進階/4-Pandas.mp4
81.2574 :  /Users/letranger/Desktop/研習/進階/1-python套件管理.mp4
84.7934 :  /Users/letranger/Desktop/研習/進階/5-網路資料解析與爬蟲.mp4
60.868 :  /Users/letranger/Desktop/研習/進階/2-Numpy.mp4
入門: 5.66小時
#+end_example
